app/views/admin/index.html.erb

SELECT COUNT(DISTINCT `posts`.`title`) FROM `posts`
---
							<p class="card-category">Records</p>
							<h3 class="card-title"><%= Post.distinct.count('title') %></h3>

SELECT COUNT(DISTINCT `artists`.`name`) FROM `artists`
---
							<p class="card-category">Artists</p>
							<h3 class="card-title"><%= Artist.distinct.count('name') %></h3>