app/views/posts/new.html.erb

      <%= f.label :artist %>
      <%= collection_select(:post, :artist_id, Artist.all, :id, :name, {:prompt => true, :multiple=>false}, {class: "form-control"})  %><br><br>
---
SELECT `artists`.* FROM `artists`