app/controllers/artists_controller.rb

INSERT INTO `artists` (`name`, `discogsid`, `created_at`, `updated_at`) VALUES ('Test', '123', '2019-08-23 18:56:30', '2019-08-23 18:56:30')
---
  def create
    # render plain: params[:artist].inspect
    @artist = Artist.new artist_params
    # @artist.avatar.attach(params[:avatar])
    if @artist.save