app/controllers/artists_controller.rb

SELECT `artists`.* FROM `artists` ORDER BY created_at DESC
---
  def index
    @artists = Artist.order('created_at DESC').with_attached_avatar

SELECT  `artists`.* FROM `artists` WHERE `artists`.`id` = 1 LIMIT 1
---
  def edit
    @artist = Artist.find(params[:id])

UPDATE `artists` SET `updated_at` = '2019-08-23 18:56:30' WHERE `artists`.`id` = 1
---
  def update
    @artist = Artist.find(params[:id])

    if @artist.update(artist_params)

SELECT  `artists`.* FROM `artists` WHERE `artists`.`id` = 1 LIMIT 1
---
  def show
    @artist = Artist.find(params[:id])

INSERT INTO `artists` (`name`, `discogsid`, `created_at`, `updated_at`) VALUES ('Test', '123', '2019-08-23 18:56:30', '2019-08-23 18:56:30')
---
  def create
    check_user_logged
    # render plain: params[:artist].inspect
    @artist = Artist.new artist_params
    # @artist.avatar.attach(params[:avatar])
    if @artist.save