app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY created_at DESC
---
  def index
    @posts = Post.order('created_at DESC').with_attached_front

INSERT INTO `posts` (`artist_id`, `title`, `discogsid`, `year`, `created_at`, `updated_at`) VALUES (2, 'Heroes', '123123', 1977, '2019-08-25 20:39:51', '2019-08-25 20:39:51')
---
  def create
    #render plain: params[:post].inspect
    @post = Post.new post_params
    @post.save